[
  {
    "id": "sewage",
    "name": "Sewage",
    "label": "Sewage – often milky grey or brown, can smell strongly. Sometimes outlets or personal care products may also be visible",
    "description": "Sewage in the river can look brown, or it can look milky grey if it has been mixed with grey wastewater before it reaches the river. It can also smell strongly, and you might spot personal care or sanitary items in or around it, making it easy to identify. Sometimes sewage outlets themselves can also be seen."
  },

  {
    "id": "sewageFungus",
    "name": "Sewage fungus",
    "label": "Sewage fungus – slimy grey, cotton wool-like, usually downstream from an outfall",
    "description": "Sewage fungus can be tricky to identify. Often it looks slimy and grey, and cotton wool-like. It is often found downstream from a sewage outfall."
  },

  {
    "id": "livestock",
    "name": "Livestock",
    "label": "Livestock – farm animals in or have access to the river",
    "description": "Are there livestock in or that have access to the water? You may see cows or sheep that are able to enter the river, where they have potential to erode the bank, disturb the bottom and transfer faeces or chemicals into the water."
  },

  {
    "id": "silt",
    "name": "Silt",
    "label": "Silt – the water looks brown, like milky tea or hot chocolate",
    "description": "Silty water has lots of sediment in it and often appears brown, a bit like milky tea or hot chocolate. This type of pollution often happens after heavy rain or cattle/animals entering the water."
  },

  {
    "id": "mineWater",
    "name": "Mine water",
    "label": "Mine water – often a bright orange colour",
    "description": "Mine water in a river can be quite distinctive and is often a vibrant orange colour. It can flow out of abandoned mines, bringing high levels of iron and other metals with it which can be damaging to river wildlife."
  },

  {
    "id": "runOff",
    "name": "Run-off",
    "label": "Road runoff – blackish, oily, rainbow sheen on the surface",
    "description": "Water containing run-off can look oily, blackish or have a rainbow sheen on the surface. Often this is washed off from roads and contains oil and brake and tyre residues that gets into rivers."
  },

  {
    "id": "algae",
    "name": "Algae",
    "label": "Algal bloom or scum – green or blue-green",
    "description": "Algal blooms or scums can make the water look bright green or blue-green, and sometimes the water surface appears dirty and crusty. Some algae blooms can produce harmful toxins, and you and your pets should keep out of the water. You may also see filamentous algae which can looks like stringy or slimy material under the water."
  }
]
