Repository: FlumensIO/big-river-watch-app
Catalog: src/common/translations/interface/*.po
Languages: cy, ga

source: <0>Slightly cloudy</0> – The water is hazy and there is some cloudiness, but objects beneath the surface are still relatively visible.
cy: <0>Ychydig yn gymylog</0> – Mae'r dŵr yn niwlog ac mae ychydig yn gymylog, ond mae gwrthrychau o dan yr arwyneb yn dal i fod yn weddol weladwy.
ga: <0>Beagán scamallach</0> – Tá an t-uisce ceoach agus tá roinnt scamallachta ann, ach tá rudaí faoin dromchla fós réasúnta le feiceáil.

source: <0>Moderately cloudy</0> – The water is noticeably cloudy, and it is difficult to see objects beneath the surface.
cy: <0>Gweddol gymylog</0> – Mae'n amlwg bod y dŵr yn niwlog, ac mae'n anodd gweld gwrthrychau o dan yr arwyneb.
ga: <0>Measartha scamallach</0> – Tá an t-uisce scamallach go suntasach, agus tá sé deacair rudaí a fheiceáil faoin dromchla.

source: <0>Very murky</0> – Water is cloudy or there is a lot of sediment, and objects beneath the surface are not visible at all.
cy: <0>Tywyll iawn</0> – Mae'r dŵr yn gymylog neu mae llawer o waddod, ac nid yw gwrthrychau o dan yr arwyneb yn weladwy o gwbl.
ga: <0>An-dhorcha</0> – Tá an t-uisce scamallach nó tá go leor dríodair ann, agus níl aon rud faoin dromchla le feiceáil ar chor ar bith.

source: <0>Unsure</0> – I cannot see how clear or cloudy the water is.
cy: <0>Ansicr</0> – Nid wyf yn gallu gweld pa mor glir neu gymylog yw'r dŵr.
ga: <0>Níl mé cinnte</0> –Ní féidir liom a fheiceáil cé chomh soiléir nó scamallach is atá an t-uisce.

source: Water
cy: Dŵr
ga: Uisce

source: Does the water smell unpleasant?
cy: Ydy'r dŵr yn arogli'n annymunol?
ga: An bhfuil boladh míthaitneamhach ar an uisce?

source: Different odors can be associated with different types and levels of pollution. On the other hand, a river with a clean, fresh smell can indicate good water quality and a healthy ecosystem.
cy: Gall arogleuon gwahanol fod yn gysylltiedig â gwahanol fathau a lefelau o lygredd. Ar y llaw arall, gall afon ag arogl glân, ffres fod yn arwydd o ansawdd dŵr da ac ecosystem iach.
ga: Is féidir boladh éagsúil a bheith bainteach le cineálacha agus leibhéil éagsúla truaillithe. Ar an láimh eile, is féidir le habhainn a bhfuil boladh glan, úr uirthi cáilíocht uisce mhaith agus éiceachóras sláintiúil a léiriú.

source: Smell
cy: Arogl
ga: Boladh

source: Can you see any litter?
cy: Allwch chi weld unrhyw sbwriel?
ga: An féidir leat aon bhruscar a fheiceáil?

source: Yes – in the river
cy: Gallaf - yn yr afon
ga: Sea – san abhainn

source: Yes – caught in the bankside vegetation (above river surface)
cy: Gallaf - wedi'i ddal yn y llystyfiant ar lan yr afon (uwchben wyneb yr afon)
ga: Sea – gafa i measc an fhásra cois bruach (os cionn dhromchla na habhann)

source: Yes – on the river banks
cy: Gallaf - ar y cefnau
ga: Sea – ar bhruach na habhann

source: No – I can't see any litter
cy: Na - ni allaf weld unrhyw sbwriel
ga: Ní fheicim aon bhruscar

source: Litter
cy: Sbwriel
ga: Bruscar

source: Can you see any other signs of pollution?
cy: Allwch chi weld unrhyw arwyddion eraill o lygredd?
ga: An féidir leat aon chomharthaí eile truaillithe a fheiceáil?

source: There are several visible signs of pollution in a river that can indicate poor water quality. It's important to monitor and address pollution sources in order to protect and restore the health of our rivers.
cy: Mae nifer o arwyddion gweladwy o lygredd mewn afon a all awgrymu ansawdd dŵr gwael. Mae'n bwysig monitro a mynd i'r afael â ffynonellau llygredd er mwyn diogelu ac adfer iechyd ein hafonydd.
ga: Tá roinnt comharthaí truaillithe le feiceáil in abhainn a d’fhéadfadh droch-chaighdeán uisce a léiriú. Tá sé tábhachtach foinsí truaillithe a mhonatóiriú agus aghaidh a thabhairt orthu chun sláinte ár n-aibhneacha a chosaint agus a athbhunú.

source: Think you see a serious pollution incident? <2>Click here</2> to read guidance on reporting it.
cy: Yn credu eich bod wedi gweld achos difrifol o lygru? <2>Cliciwch yma</2>i ddarllen canllaw ar sut i'w adrodd.
ga: An gceapann tú go bhfeiceann tú eachtra thromchúiseach truaillithe? <2>Cliceáil anseo</2> chun treoir a léamh maidir le tuairisciú a dhéanamh air.

source: <0><0>Sewage</0> – often milky grey or brown, can smell strongly. Sometimes outlets or personal care products may also be visible</0>
cy: <0><0>Gall carthion</0> – sy'n aml yn lliw llwyd llaethog neu frown, arogli'n gryf. Weithiau gall gollyngfeydd neu gynhyrchion gofal personol fod yn weladwy hefyd
ga: <0><0>Séarachas</0> – is minic a bhíonn sé liath nó donn bainne, agus bíonn boladh láidir air. Uaireanta bíonn asraonta nó táirgí cúraim phearsanta le feiceáil freisin</0>

source: <0><0>Sewage fungus</0> – slimy grey, cotton wool-like, usually downstream from an outfall</0>
cy: <0><0>Ffwng carthion</0> – llwyd, llysnafeddog, tebyg i wlân cotwm, fel arfer i lawr yr afon o ollyngfa</0>
ga: <0><0>Fungas séarachais</0> – iath sleamhain, cosúil le olann chadáis, de ghnáth síos an abhainn ó sceitheadh</0>

source: <0><0>Livestock</0> – farm animals in or have access to the river</0>
cy: <0><0>Da byw</0> - anifeiliaid fferm yn yr afon neu gyda mynediad i'r afon</0>
ga: <0><0>Beostoc</0> – ainmhithe feirme san abhainn nó a bhfuil rochtain acu uirthi</0>

source: <0><0>Silt</0> – the water looks brown, like milky tea or hot chocolate</0>
cy: <0><0>Silt</0> - mae'r dŵr yn edrych yn frown, tebyg i de llaethog neu siocled poeth</0>
ga: <0><0>Silt</0> – tá cuma donn ar an uisce, cosúil le tae bainne nó seacláid te</0>

source: <0><0>Mine water</0> – often a bright orange colour</0>
cy: <0><0>Dŵr mwynglawdd</0> - yn aml o liw oren llachar</0>
ga: <0><0>Uisce mianach</0> – dath oráiste geal go minic</0>

source: <0><0>Road runoff</0> – blackish, oily, rainbow sheen on the surface</0>
cy: <0><0>Dŵr ffo o ffyrdd</0> - sglein du, olewog, amryliw ar y wyneb</0>
ga: <0><0>Uisce bóthair </0> – dubh, olach, snasta tuar ceatha ar an dromchla</0>

source: <0><0>Algal bloom or scum</0> – green or blue-green</0>
cy: <0><0>Blodau algaidd neu lysnafedd</0> - gwyrdd neu wyrddlas</0>
ga: <0><0>Bláth algaí nó screamh</0> – glas nó gormghlas</0>

source: None – I can't see any visible signs of pollution
cy: Dim - ni allaf weld unrhyw arwyddion gweladwy o lygredd
ga: Dada – ní fheicim aon chomharthaí infheicthe truaillithe

source: Noticing the good things in nature can bring sustained and significant improvements in your well-being. Note down three good things that you've noticed by the river today.
cy: Gall sylwi ar y pethau da ym myd natur ddod â gwelliannau parhaus a sylweddol yn eich llesiant. Nodwch dri pheth da yr ydych wedi sylwi arnynt wrth yr afon heddiw.
ga: Is féidir le tabhairt faoi deara na rudaí maithe sa nádúr feabhsuithe suntasacha leanúnacha a thabhairt ar do fholláine. Scríobh síos trí rud mhaithe a thug tú faoi deara cois na habhann inniu.

source: This could be something you have seen, heard, or smelled.
cy: Gall hyn fod yn rhywbeth rydych wedi'i weld, ei glywed neu ei arogli.
ga: D’fhéadfadh gur rud é seo a chonaic tú, a chuala tú, nó a bholadh tú.

source: Enter here...
cy: Nodwch yma...
ga: Cuir isteach anseo...

source: Good things
cy: Pethau da
ga: Rudaí maithe

source: Is there anything else you'd like to share before you submit your survey?
cy: Oes yna unrhyw beth arall yr hoffech ei rannu cyn i chi gyflwyno eich arolwg?
ga: An bhfuil aon rud eile ar mhaith leat a roinnt sula gcuireann tú do shuirbhé isteach?

source: This could be other animals you have seen, things you have observed on previous occasions, anything we have not asked about that you feel is important.
cy: Gallai hyn fod yn anifeiliaid eraill rydych wedi'u gweld, pethau rydych wedi sylwi arnynt ar achlysuron blaenorol, unrhyw beth nad ydym wedi gofyn amdano rydych chi'n teimlo sy'n bwysig.
ga: D’fhéadfadh gur ainmhithe eile a chonaic tú iad seo, rudaí a chonaic tú roimhe seo, aon rud nár fhiafraíomar faoi a mheasann tú atá tábhachtach.

source: Enter more information here...
cy: Nodwch fwy o wybodaeth yma...
ga: Cuir isteach tuilleadh eolais anseo...

source: Finish
cy: Gorffen
ga: Críochnaigh

source: Comment
cy: Sylwadau
ga: Trácht

source: Save for later
cy: Cadw ar gyfer nes ymlaen
ga: Sábháil le haghaidh níos déanaí

source: Upload
cy: Lanlwytho
ga: Uaslódáil

source: Draft
cy: Drafft
ga: Dréacht

source: Today
cy: Heddiw
ga: Inniu

source: Yesterday
cy: Ddoe
ga: Inné

source: Thank you!
cy: Diolch!
ga: Go raibh maith agat!

source: We appreciate you taking the time to fill out the survey.
cy: Rydym yn ddiolchgar i chi am gymryd yr amser i lenwi'r arolwg.
ga: Tugaimid buíochas duit as an am a thóg tú chun an suirbhé a líonadh isteach.

source: Are you sure you want to delete this record?
cy: Ydych chi'n siŵr eich bod am ddileu'r cofnod hwn?
ga: An bhfuil tú cinnte gur mian leat an taifead seo a scriosadh?

source: Information
cy: Gwybodaeth
ga: Eolas

source: Language
cy: Iaith
ga: Teanga

source: Thanks to the following for additional photos:
cy: Diolch i'r canlynol am y lluniau ychwanegol
ga: Buíochas leis na daoine seo a leanas as grianghraif bhreise:

source: Looks like you are offline!
cy: Rydych chi oddi ar-lein mae'n debyg!
ga: Is cosúil go bhfuil tú as líne!

source: Please wait...
cy: Arhoswch...
ga: Fan le do thoil...

source: Sorry, we have encountered a problem while uploading the record.
cy: Rydym wedi dod ar draws problem wrth anfon y cofnod
ga: Tá brón orainn, tháinig fadhb chun cinn agus an taifead á uaslódáil.

source: Sorry
cy: Sori
ga: Tá brón orm.

source: timeout
cy: amser wedi dod i ben
ga: sos ama

source: Location services are not enabled
ga: Níl seirbhísí suímh cumasaithe

source: Export database
ga: Easpórtáil bunachar sonraí

source: FAQ
cy: Cwestiynau Cyffredin
