Repository: FlumensIO/big-river-watch-app
Catalog: src/common/translations/interface/*.po
Languages: cy, ga

source: Welcome to <1>Big River Watch</1>!
cy: Croeso i'r arolwg <1>Big River Watch</1>!
ga: Fáilte go dtí <1>Big River Watch</1>!

source: Take part in the survey to help us understand the health of our rivers.
cy: Cymerwch ran yn yr arolwg i'n helpu i ddeall iechyd ein hafonydd.
ga: Glac páirt sa suirbhé chun cabhrú linn sláinte ár n-aibhneacha a thuiscint.

source: Simply sign up and pick a riverside location that you can spend 10-15 mins observing.
cy: Cofrestrwch a dewiswch leoliad glan afon y gallwch dreulio 10-15 munud yn ei arsylwi.
ga: Níl le déanamh ach clárú agus suíomh cois abhann a roghnú ar féidir leat 10-15 nóiméad a chaitheamh ag breathnú air.

source: Look out for things like wildlife, plants and pollution, then start the survey in this app to tell us what you can see. Click ‘submit’ to send us your results!
cy: Cadwch olwg am bethau fel bywyd gwyllt, planhigion a llygredd. Cwblhewch yr arolwg yn yr ap hwn i roi gwybod i ni'r hyn y gallwch ei weld. Cliciwch ar 'cyflwyno' i anfon eich canlyniadau atom!
ga: Bí ag faire amach do rudaí cosúil le fiadhúlra, plandaí agus truailliú, ansin cuir tús leis an suirbhé san aip seo chun a insint dúinn cad is féidir leat a fheiceáil. Cliceáil ‘cuir isteach’ chun do thorthaí a sheoladh chugainn!

source: Not sure what you’re looking at?
cy: Ddim yn siŵr beth rydych chi'n edrych arno?
ga: Níl tú cinnte cad atá á lorg agat?

source: Use our handy ID guides to help identify some of the different species or types of pollution you might come across.
cy: Defnyddiwch ein canllawiau defnyddiol i'ch helpu i adnabod rhai o'r gwahanol rywogaethau neu wahanol fathau o lygredd y gallech ddod ar eu traws.
ga: Bain úsáid as ár dtreoracha aitheantais úsáideacha chun cabhrú leat cuid de na speicis nó na cineálacha éagsúla truaillithe a d’fhéadfá teacht orthu a aithint.

source: Remember, you should never enter the river to take part in <2>Big River Watch</2>.
cy: Cofiwch: ni ddylech fyth fynd i mewn i afon wrth gymryd rhan yn <2>Big River Watch</2>.
ga: Cuimhnigh, níor cheart duit dul isteach san abhainn choíche le páirt a ghlacadh i <2>Big River Watch</2>.

source: Find somewhere safe nearby to the river where there is no risk of slipping into the water, and enjoy a peaceful time observing river life.
cy: Chwliwch am fan diogel wrth ymyl afon lle nad oes unrhyw berygl o lithro i'r dŵr. Mwynhewch amser hamddenol yn arsylwi bywyd yr afon.
ga: Aimsigh áit shábháilte in aice leis an abhainn nach bhfuil aon bhaol ann go sleamhnóidh tú isteach san uisce, agus bain sult as am síochánta ag breathnú ar shaol na habhann.

source: Click to confirm you’ve read the <2>Health and Safety guidance</2> and you agree to our <6>Terms and Conditions</6>.
cy: Cliciwch i gadarnhau eich bod wedi darllen y <2>canllawiau Iechyd a Diogelwch</2> a'ch bod yn cytuno â'n<6>Telerau ac Amodau</6>.
ga: Cliceáil chun a dheimhniú gur léigh tú an <2> treoir Sláinte agus Sábháilteachta</2> agus go n-aontaíonn tú lenár <6>Téarmaí agus Coinníollacha</6>.

source: Confirm
cy: Cadarnhau
ga: Deimhnigh

source: Home
cy: Hafan
ga: Baile

source: Surveys
cy: Arolygon
ga: Suirbhéanna

source: Wildlife
cy: Byw gllt
ga: Fiadhúlra

source: Pollution
cy: Llygredd
ga: Truailliú

source: Start survey
cy: Dechrau'r arolwg
ga: Tosaigh suirbhé

source: Pending
cy: Anorffenedig
ga: Ar feitheamh

source: Uploaded
cy: Wedi'i uwchlwytho
ga: Uaslódáilte

source: You don't have any records in this list yet.
cy: Nid oes gennych chi unrhyw gofnodion yn y rhestr hon eto.
ga: Níl aon taifid agat sa liosta seo go fóill.

source: Beaver
cy: Afanc
ga: Beabhar

source: Coot
cy: Cwtiar
ga: Cóta

source: Dipper
cy: Trochwr
ga: An Tumadóir

source: Dragonflies and damselflies
cy: Gweision y neidr neu fursennod
ga: Dreigíní agus damselflies

source: Ducks
cy: Hwyaid
ga: Lachain

source: Fish
cy: Pysgod
ga: Iasc

source: Grey Wagtail
cy: Siglen lwyd
ga: Eireaball Liath

source: Heron
cy: Crëyr
ga: Corr Réisc

source: Kingfisher
cy: Glas y dorlan
ga: Iascaire Ríog

source: Mayflies, caddisflies and stoneflies
cy: Cylion Mai, pryfed pric a phryfed y cerrig
ga: Cuileoga Bealtaine, cuileoga caddis agus cuileoga cloiche

source: Moorhen
cy: Iâr ddŵr
ga: Cearc uisce

source: Otter
cy: Dyfrgi
ga: Dobharchú

source: Rat
cy: Llygoden fawr
ga: Francach

source: Swan
cy: Alarch
ga: Eala

source: Description
cy: Disgrifiad
ga: Cur síos

source: Beavers are becoming more common across the UK. These large, semi-aquatic rodents have brown fur, a flat paddle-like tail and can sometimes be seen swimming or eating willow on the riverbank. You’re most likely to spot them at dawn or at dusk.
cy: Mae afancod yn dod yn fwy cyffredin ledled y DU. Mae gan y cnofilod mawr, lled-ddyfrol hyn ffwr brown a chynffon fflat fel padl. Gallwch eu gweld weithiau yn nofio neu'n bwyta helyg ar lan yr afon. Rydych chi'n fwyaf tebygol o'u gweld gyda'r wawr neu gyda'r nos.
ga: Tá béibéirí ag éirí níos coitianta ar fud na Ríochta Aontaithe. Tá fionnadh donn agus eireaball cothrom cosúil le rámha ar na creimirí móra leathuisceacha seo agus is féidir iad a fheiceáil uaireanta ag snámh nó ag ithe saileach ar bhruach na habhann. Is dóichí go bhfeicfidh tú iad ag breacadh an lae nó ag luí na gréine.

source: Coots are also medium-sized and have dark black feathers, but they have a bright white bill and white feathers that extends backwards over their forehead.
cy: Mae cwtieir yn ganolig eu maint. Mae eu plu yn ddu yn bennaf ac mae ganddynt big gwyn llachar a phlu gwyn sy'n ymestyn yn ôl dros eu talcen.
ga: Tá na coiligh mheánmhéide freisin agus tá cleití dubha dorcha acu, ach tá gob bán geal agus cleití bána acu a shíneann siar thar a n-éadan.

source: Dippers are small, dark brown birds with a white breast patch that extends down their throat. They can often be seen standing and bobbing up and down on rocks on the water’s edge in fast-flowing rivers, where they search for insects.
cy: Mae trochwyr yn adar bach, brown tywyll gyda patsh gwyn ar y frest sy'n ymestyn i lawr eu gwddf. Gellir eu gweld yn aml yn sefyll ac yn siglo i fyny ac i lawr ar greigiau ar ymyl y dŵr mewn afonydd cyflym, lle maent yn chwilio am bryfed.
ga: Is éin bheaga donn dorcha iad tumadóirí le paiste bán ar a gcíoch a shíneann síos a scornach. Is minic a fheictear iad ina seasamh agus ag luascadh suas agus síos ar charraigeacha ar imeall an uisce in aibhneacha gasta, áit a mbíonn siad ag cuardach feithidí.

source: By a river in the summer, you might spot a variety of different sized and coloured dragonflies and dameselflies; These are thin insects with dark wings, large heads and long abdomens and are often seen hovering and flying over and around the water. The wings on a resting dragonfly extend out to the sides of their body, while the wings on a resting damselfly, which are normally smaller and more delicate, reach backwards in line with their long bodies.
cy: Wrth afon yn yr haf, efallai y gwelwch amrywiaeth o weision neidr a mursennod o wahanol faint a lliw. Mae’r rhain yn bryfed tenau gydag adenydd tywyll, pennau mawr ac abdomenau hir. Maent i’w gweld yn aml yn hofran ac yn hedfan dros ac o gwmpas y dŵr. Mae'r adenydd ar was y neidr sy'n gorffwys yn ymestyn allan i ochrau ei gorff, tra bod yr adenydd ar fursen sy'n gorffwys, sydd fel arfer yn llai ac yn fwy eiddil, yn ymestyn yn ôl yn unol â'u cyrff hir.
ga: Cois abhann sa samhradh, d’fhéadfá réimse leathan dreigíní agus banmhacán de mhéideanna agus dathanna difriúla a fheiceáil; Is feithidí tanaí iad seo le sciatháin dhorcha, cinn mhóra agus bolg fada agus is minic a fheictear iad ag eitilt agus ag crochadh os cionn agus timpeall an uisce. Síneann sciatháin dreigíní atá i scíth amach go dtí taobhanna a gcorp, agus síneann sciatháin banmhacáin atá i scíth, a bhíonn níos lú agus níos míne de ghnáth, siar i líne lena gcorp fada.

source: Ducks are common in many waterways. There are many different species of duck, each with large bills, short necks and webbed feet. The mallard is one of the UK’s best-known ducks; males have a distinctive green head, and females are brown.
cy: Mae hwyaid yn gyffredin mewn llawer o ddyfrffyrdd. Mae llawer o rywogaethau o hwyaden, pob un gyda phig mawr, gwddf byr a thraed gweog. Yr hwyaden wyllt yw un o'r hwyaid mwyaf adnabyddus yn y DU. Mae gan y gwrywod ben gwyrdd nodweddiadol ac mae'r benywod yn frown.
ga: Tá lachain coitianta i mórán uiscebhealaí. Tá go leor speiceas éagsúla lachain ann, agus gob mór, muineál gearr agus cosa gréasánacha ag gach ceann acu. Tá an mallard ar cheann de na lachain is cáiliúla sa Ríocht Aontaithe; tá ceann glas sainiúil ag na fireannaigh, agus tá dath donn ar na baineannaigh.

source: A large number of different fish species can be found in rivers in the UK and Ireland. They vary in size and shape, and it is not always possible to identify them just by sight from the riverbank. So, for this survey, simply record whether you saw any fish or not during your river observation.
cy: Mae nifer fawr o rywogaethau pysgod gwahanol i'w cael mewn afonydd yn y DU ac Iwerddon. Maent yn amrywio o ran maint a siâp, ac nid yw bob amser yn bosibl eu hadnabod wrth eu gweld o lan yr afon. Felly, at ddibenion yr arolwg hwn, cofnodwch a welsoch chi unrhyw bysgodyn ai peidio wrth arsylwi'r afon.
ga: Is féidir líon mór speiceas éisc éagsúla a fháil in aibhneacha sa Ríocht Aontaithe agus in Éirinn. Athraíonn siad i méid agus i gcruth, agus ní bhíonn sé indéanta i gcónaí iad a aithint trí radharc amháin ón mbruach abhann. Mar sin, don suirbhé seo, níl le déanamh ach taifead a dhéanamh cibé an bhfaca tú aon iasc nó nach bhfaca le linn do bhreathnóireachta ar an abhainn.

source: These small birds have slate grey plumage on their upper parts, but their underside is a vibrant yellow. Grey wagtails nest near fast-flowing water and eat insects found at the river edge.
cy: Mae gan yr adar bach hyn blu llwydlas ar eu rhannau uchaf, ond mae eu hochr isaf yn felyn llachar. Mae siglennod llwyd yn nythu ger dŵr sy'n llifo'n gyflym ac yn bwyta pryfed a geir ar ymyl yr afon.
ga: Tá clúmh liath liath ar na codanna uachtaracha de na héin bheaga seo, ach tá dath buí geal ar a gcuid íochtair. Neadaíonn na gealbhain liatha in aice le huisce atá ag sreabhadh go tapa agus itheann siad feithidí a fhaightear ar bhruach na habhann.

source: Herons are large birds, reaching up to a meter in height and you’re unlikely to mistake them for another species. They have mainly grey plumage, long yellow legs and a long neck leading to a pointed yellow bill.
cy: Mae crehyrod yn adar mawr, sy’n cyrraedd hyd at fetr o daldra. Mae’n annhebygol y byddwch yn eu camgymryd am rywogaeth arall. Mae ganddynt blu llwyd yn bennaf, coesau hir melyn a gwddf hir sy'n arwain at big melyn pigfain.
ga: Is éin mhóra iad na corra, suas le méadar ar airde agus ní dócha go measfá gur speiceas eile iad. Tá clúmh liath den chuid is mó acu, cosa fada buí agus muineál fada a fhágann go bhfuil gob buí biorach orthu.

source: These small, fast-flying birds are always a treat to see. Their bright blue and orange bodies add a splash of colour as they perch on branches, or dart quickly into the water to catch fish with their long black bills.
cy: Mae'n hyfryd bob amser gweld yr adar bach hyn sy'n hedfan yn gyflym. Mae eu cyrff glas ac oren llachar yn ychwanegu sblash o liw wrth iddynt glwydo ar ganghennau, neu wibio'n gyflym i mewn i'r dŵr i ddal pysgod gyda'u pigau du hir.
ga: Is breá an rud iad na héin bheaga seo a fheiceáil i gcónaí, iad siúd a bhíonn ag eitilt go gasta. Cuireann a gcorp gealghorm agus oráiste dath leis agus iad ag suí ar chraobhacha, nó ag rith go gasta isteach san uisce chun iasc a ghabháil lena ngob fada dubh.

source: Collectively known as ‘riverflies’, the larvae of these winged insects spend most of their life in the river, where they are a great food source for large fish. They emerge as flying adults for just a short period of time to reproduce. They are often under 3 cm in size. Many of the riverflies are not tolerant of pollution, so their presence can be used as an indicator of good water quality.
cy: Yn cael eu hadnabod gyda’i gilydd fel ‘pryfed afon’. Mae larfa’r pryfed asgellog hyn yn treulio’r rhan fwyaf o’u hoes yn yr afon ac maent yn ffynhonnell fwyd wych i bysgod mawr. Maent yn ymddangos fel oedolion sy'n hedfan am gyfnod byr yn unig i atgenhedlu. Maent yn aml yn llai na 3cm o faint. Nid yw llawer o bryfed yr afon yn gallu goddef llygredd, felly mae eu presenoldeb yn arwydd o ansawdd dŵr da.
ga: Ar a dtugtar ‘cuileoga abhann’ le chéile, caitheann larbhaí na bhfeithidí sciathánacha seo formhór a saoil san abhainn, áit a bhfuil siad ina bhfoinse bia iontach d’iasc móra. Tagann siad chun cinn mar fheithidí fásta ag eitilt ar feadh tréimhse ghearr ama le hatáirgeadh. Is minic a bhíonn siad faoi bhun 3 cm ar mhéid. Ní fhulaingíonn go leor de na cuileoga abhann truailliú, mar sin is féidir a láithreacht a úsáid mar tháscaire ar cháilíocht mhaith uisce.

source: Moorhens are about the size of a duck, but are largely black with a bright red and yellow beak, with long green legs and un-webbed feet.
cy: Mae ieir dŵr tua'r un maint â hwyaid. Mae eu plu'n ddu yn bennaf ac mae ganddynt big coch a melyn llachar a choesau hir gwyrdd. Nid yw eu traed yn weog.
ga: Tá cearca uisce thart ar mhéid lachan, ach bíonn siad dubh den chuid is mó le gob geal dearg agus buí, le cosa fada glasa agus cosa gan ghruaig.

source: Otters appear brown or grey, have slimmer bodies than beavers and a long thin tail. They’re a top predator in a river habitat, can be playful and are very fast swimmers with an impressive ability to hold their breath underwater.
cy: Mae dyfrgwn yn frown neu'n llwyd. Mae ganddynt gyrff teneuach nag afancod a chynffon hir denau. Maent yn brif ysglyfaethwr mewn cynefin afon. Gallant fod yn chwareus ac maent yn nofwyr cyflym iawn gyda gallu trawiadol i ddal eu hanadl o dan y dŵr.
ga: Tá cuma donn nó liath ar dhobharchúnna, tá coirp níos caol acu ná mar atá ar bhéibhir agus eireaball fada tanaí. Is creachadóir den scoth iad i ngnáthóg abhann, is féidir leo a bheith súgach agus is snámhóirí an-tapa iad a bhfuil cumas suntasach acu a n-anáil a shealbhú faoin uisce.

source: Rats are strong swimmers and can often be found around rivers, particularly in urban waterways. They are brown with short fur, a pointy face and a long pink tail. Rats can carry some human diseases and so it is important to always wash hands carefully after being in contact with river water.
cy: Mae llygod mawr yn nofwyr cryf a gellir eu gweld yn aml o gwmpas afonydd, yn enwedig dyfrffyrdd trefol. Maent yn frown gyda blew cwta, wyneb main a chynffon hir binc. Gall llygod mawr gario rhai clefydau dynol, felly mae'n bwysig bob amser i olchi eich dwylo'n ofalus ar ôl bod mewn cysylltiad â dŵr afon.
ga: Is snámhóirí láidre iad francaigh agus is minic a fhaightear iad timpeall aibhneacha, go háirithe in uiscebhealaí uirbeacha. Tá siad donn le fionnadh gearr, aghaidh biorach agus eireaball fada bándearg. Is féidir le francaigh roinnt galair dhaonna a iompar agus mar sin tá sé tábhachtach lámha a ní go cúramach i gcónaí tar éis teagmháil a dhéanamh le huisce abhann.

source: Swans are large white waterbirds, with elongated s-shaped necks, often orange bills and a large wingspan. You might also see younger swans, known as cygnets, which are grey/brown in colour before they turn white.
cy: Mae elyrch yn adar dŵr mawr gwyn, gyda gwddf hirfain siâp s, pig oren yn aml a lled esgyll mawr. Efallai y gwelwch gywion elyrch hefyd sy'n llwyd neu frown cyn iddynt droi'n wyn.
ga: Is éin uisce bána móra iad ealaí, le muineál fada S-chruthach, gob oráiste go minic agus réise sciatháin mhór. D’fhéadfá ealaí níos óige, ar a dtugtar cíogáin, a fheiceáil freisin, atá liath/donn sula dtéann siad bán.

source: There are many different types of pollution that can be found in our waterways. Some, like chemicals and nutrients are hard to identify, but others are easier to see. Here are a few examples of the more common types of pollution.
cy: Mae llawer o wahanol fathau o lygredd i'w gweld yn ein dyfrffyrdd. Mae rhai fel cemegion a maetholion yn anodd eu hadnabod, ond mae eraill yn haws i'w gweld. Dyma ychydig enghreifftiau o'r mathau mwyaf cyffredin o lygredd.
ga: Tá go leor cineálacha éagsúla truaillithe le fáil inár n-uiscebhealaí. Tá cuid acu, cosúil le ceimiceáin agus cothaithigh, deacair a aithint, ach tá cinn eile níos éasca a fheiceáil. Seo roinnt samplaí de na cineálacha truaillithe is coitianta.

source: Algae
cy: Algâu
ga: Algaí

source: Livestock
cy: Da byw
ga: Beostoc

source: Mine water
cy: Dŵr mwynglawdd
ga: Uisce mianach

source: Run-off
cy: Dŵr ffo
ga: Rith amach

source: Sewage
cy: Gall carthion
ga: Séarachas

source: Sewage fungus
cy: Ffwng carthion
ga: Fungas séarachais

source: Silt
ga: Gráta

source: Algal blooms or scums can make the water look bright green or blue-green, and sometimes the water surface appears dirty and crusty. Some algae blooms can produce harmful toxins, and you and your pets should keep out of the water. You may also see filamentous algae which can looks like stringy or slimy material under the water.
cy: Gall blodau algaidd neu lysnafedd wneud i'r dŵr edrych yn wyrdd llachar neu'n laswyrdd, ac weithiau mae wyneb y dŵr yn ymddangos yn fudr ac yn grystiog. Gall rhai blodau algâu gynhyrchu tocsinau niweidiol, a dylech chi a'ch anifeiliaid anwes gadw allan o'r dŵr. Efallai y byddwch hefyd yn gweld algâu ffilamentog a all edrych fel deunydd llinynnol neu lysnafeddog o dan y dŵr.
ga: Is féidir le blátha algaí nó screamh a chur ar an uisce cuma ghealghlas nó ghormghlas a chur air, agus uaireanta bíonn cuma salach agus screamhach ar dhromchla an uisce. Is féidir le roinnt bláthanna algaí tocsainí díobhálacha a tháirgeadh, agus ba chóir duit féin agus do pheataí fanacht amach as an uisce. D’fhéadfá algaí filiméadacha a fheiceáil faoin uisce freisin, a d’fhéadfadh a bheith cosúil le hábhar sreangach nó sleamhain.

source: Are there livestock in or that have access to the water? You may see cows or sheep that are able to enter the river, where they have potential to erode the bank, disturb the bottom and transfer faeces or chemicals into the water.
cy: A oes yna dda byw yn y dŵr neu gyda mynediad ato? Efallai y gwelwch wartheg neu ddefaid sy'n gallu mynd i mewn i'r afon. Gall dda byw erydu'r gefnen, tarfu ar waelod yr afon a throsglwyddo ysgarthion neu gemegau i mewn i'r dŵr.
ga: An bhfuil beostoc san uisce nó an bhfuil rochtain acu ar an uisce? B’fhéidir go bhfeicfidh tú ba nó caoirigh atá in ann dul isteach san abhainn, áit a bhfuil an baol ann go gcreimfidh siad an bruach, go gcuirfidh siad isteach ar an ngrinneall agus go n-aistreoidh siad feces nó ceimiceáin isteach san uisce.

source: Mine water in a river can be quite distinctive and is often a vibrant orange colour. It can flow out of abandoned mines, bringing high levels of iron and other metals with it which can be damaging to river wildlife.
cy: Gall dŵr mwynglawdd mewn afon fod yn eithaf nodweddiadol ac yn aml mae'n lliw oren llachar. Gall lifo allan o fwyngloddiau segur, gan ddod â lefelau uchel o haearn a metelau eraill gydag ef a all fod yn niweidiol i fywyd gwyllt yr afon.
ga: Is féidir le huisce mianach in abhainn a bheith sách sainiúil agus is minic a bhíonn dath oráiste geal air. Is féidir leis sreabhadh amach as mianaigh tréigthe, ag tabhairt leibhéil arda iarainn agus miotail eile leis a d’fhéadfadh dochar a dhéanamh do fhiadhúlra na habhann.

source: Water containing run-off can look oily, blackish or have a rainbow sheen on the surface. Often this is washed off from roads and contains oil and brake and tyre residues that gets into rivers.
cy: Gall ddŵr sy'n cynnwys dŵr ffo edrych yn olewog, yn dywyll neu fod â sglein amryliw ar y wyneb. Mae dŵr ffo yn aml yn cael ei gario o ffyrdd ac yn cynnwys olew a gwaddodion brêcs a theiars sydd yn mynd i mewn i afonydd.
ga: Is féidir le huisce ina bhfuil sceitheadh ​​cuma olach, dhubh nó snasta tuar ceatha a bheith air ar dhromchla an uisce. Is minic a nitear é seo de na bóithre agus bíonn ola agus iarmhair coscáin agus boinn ann a théann isteach sna haibhneacha.

source: Sewage in the river can look brown, or it can look milky grey if it has been mixed with grey wastewater before it reaches the river. It can also smell strongly, and you might spot personal care or sanitary items in or around it, making it easy to identify. Sometimes sewage outlets themselves can also be seen.
cy: Gall carthion yn yr afon edrych yn frown, neu gall edrych yn llwyd llaethog os yw wedi'i gymysgu â dŵr gwastraff llwyd cyn iddo gyrraedd yr afon. Gall arogli'n gryf hefyd, ac efallai y gwelwch eitemau gofal personol neu ar gyfer y mislif ynddo neu o'i gwmpas, gan ei gwneud hi'n hawdd ei adnabod. Weithiau gellir gweld gollyngfeydd carthion eu hunain hefyd.
ga: Is féidir go mbeidh cuma dhonn ar shéarachas san abhainn, nó go mbeidh cuma liath bhainne air má meascadh é le fuíolluisce liath sula sroicheann sé an abhainn. Is féidir go mbeidh boladh láidir air freisin, agus d’fhéadfá earraí cúraim phearsanta nó sláintíochta a fheiceáil ann nó timpeall air, rud a fhágann go bhfuil sé éasca é a aithint. Uaireanta is féidir asraonta séarachais féin a fheiceáil freisin.

source: Sewage fungus can be tricky to identify. Often it looks slimy and grey, and cotton wool-like. It is often found downstream from a sewage outfall.
cy: Gall fod yn anodd adnabod ffwng carthion. Yn aml mae'n edrych yn llysnafeddog a llwyd, ac yn debyg i wlân cotwm. Fe'i darganfyddir yn aml i lawr yr afon o ollyngfa carthion.
ga: Is féidir go mbeadh sé deacair fungas séarachais a aithint. Is minic a bhíonn cuma shleamhain agus liath air, agus cuma olann chadáis air. Is minic a fhaightear é síos an abhainn ó sceitheadh ​​séarachais.

source: Silty water has lots of sediment in it and often appears brown, a bit like milky tea or hot chocolate. This type of pollution often happens after heavy rain or cattle/animals entering the water.
cy: Mae gan ddŵr silt lawer o waddod ynddo ac mae'n ymddangos yn frown yn aml, ychydig fel te llaethog neu siocled poeth. Mae'r math hwn o lygredd yn digwydd yn aml ar ôl glaw trwm neu ar ôl i wartheg/anifeiliaid fod yn y dŵr.
ga: Bíonn neart dríodair in uisce láibeach agus is minic a bhíonn cuma donn air, rud beag cosúil le tae bainne nó seacláid te. Is minic a tharlaíonn an cineál seo truaillithe i ndiaidh báisteach throm nó tar éis eallach/ainmhithe dul isteach san uisce.

source: Info
cy: Gb’aeth
ga: Eolas

source: Settings
cy: Gosodiadau
ga: Socruithe

source: About
cy: Ynghylch
ga: Maidir

source: Partners
cy: Partneriaid
ga: Comhpháirtithe

source: Health and Safety
cy: Iechyd a Diogelwch
ga: Sláinte agus Sábháilteacht

source: Terms and Conditions
cy: Telerau ac Amodau
ga: Téarmaí agus Coinníollacha

source: Privacy Policy
cy: Polisi Preifatrwydd
ga: Polasaí Príobháideachais

source: Report pollution
cy: Llygredd
ga: Tuairiscigh truailliú

source: Share App Analytics
cy: Rhannu Dadansoddeg Ap
ga: Comhroinn Anailísíocht Aipeanna

source: Share app crash data so we can make the app more reliable.
cy: Rhannu data chwalu o'r ap fel y gallwn wneud yr ap yn fwy dibynadwy.
ga: Comhroinn sonraí tuairteála aipeanna ionas gur féidir linn an aip a dhéanamh níos iontaofa.

source: App version
cy: Fersiwn o'r Ap
ga: Leagan an aip

source: Back
cy: Yn ôl
ga: Ar ais
