Repository: FlumensIO/big-river-watch-app
Catalog: src/common/translations/interface/*.po
Languages: cy, ga

source: <0>Big River Watch</0> is an invitation for communities to love their local river and to be part of the movement demanding better for our rivers. It consists of a free app containing a simple survey, and anybody in the UK and Ireland who can access a river can take part – all you need to do is spend a little time watching your local watercourse and answering the questions. All of the survey data will provide a large-scale picture of river health, and help us fight for better for our rivers.
cy: <0> Mae The Big River Watch </0> yn wahoddiad i gymunedau sydd wedi gwirioni â’u hafonydd lleol i fod yn rhan o’r mudiad sy’n mynnu gwell i’n hafonydd. Mae’n cynnwys ap am ddim sydd â holiadur syml. Gall unrhyw un yn y Deyrnas Unedig ac Iwerddon sydd â mynediad i afon gymryd rhan – y cwbl sydd angen i chi ei wneud yw treulio ychydig o amser yn gwylio dyfrgwrs sy’n lleol i chi ac ateb y cwestiynau. Bydd holl ddata’r arolwg yn rhoi darlun ar raddfa fawr o iechyd afonydd, ac yn ein helpu i frwydro am well dros ein hafonydd.
ga: <0>Big River Watch</0> do phobail grá a thabhairt dá n-abhainn áitiúil agus a bheith mar chuid den ghluaiseacht atá ag éileamh feabhsúcháin dár n-aibhneacha. Is aip saor in aisce é ina bhfuil suirbhé simplí, agus is féidir le duine ar bith sa Ríocht Aontaithe agus in Éirinn a bhfuil rochtain aige ar abhainn páirt a ghlacadh – níl le déanamh agat ach beagán ama a chaitheamh ag breathnú ar do chúrsa uisce áitiúil agus ag freagairt na gceisteanna. Cuirfidh na sonraí suirbhé go léir pictiúr fairsing ar fáil de shláinte na habhann, agus cabhróidh siad linn troid ar son feabhsúcháin dár n-aibhneacha.

source: Big River Watch has been developed by The Rivers Trust. The Rivers Trust is an umbrella organisation for our 65 member Rivers Trusts across Britain, Northern Ireland and Ireland. We are river and catchment conservation experts with a wealth of data and expertise at our fingertips. We are together, for rivers. Find out more about the Big River Watch partners on our <2>website</2>.
cy: Datblygwyd The Big River Watch gan yr Ymddiriedolaeth Afonydd. Mae'r Ymddiriedolaeth Afonydd yn sefydliad ymbarél ar gyfer ein 65 o aelodau’r Ymddiriedolaeth Afonydd ledled Prydain, Gogledd Iwerddon ac Iwerddon. Rydym yn arbenigwyr cadwraeth afonydd a’u dalgylchoedd ac mae gennym gyfoeth o ddata ac arbenigedd ar flaenau ein bysedd. Gweithredwn mewn undod dros ein hafonydd. Ceir rhagor o wybodaeth ynghylch partneriaid The Big River Watch ar ein <2>gwefan</2>.
ga: D'fhorbair Iontaobhas na nAibhneacha Big River Watch. Is eagraíocht scáth í Iontaobhas na nAibhneacha dár 65 Iontaobhas Aibhneacha atá ina mbaill ar fud na Breataine, Thuaisceart Éireann agus Éireann. Is saineolaithe caomhnaithe abhann agus dobharcheantar muid agus tá stór sonraí agus saineolais againn. Táimid le chéile, ar son na n-aibhneacha. Faigh tuilleadh eolais faoi chomhpháirtithe Faire na nAibhneacha Big ar ár <2>láithreán gréasáin</2>.

source: To find out more about The Rivers Trust, follow us on social media @theriverstrust.
cy: I gael gwybod mwy am Yr Ymddiriedolaeth Afonydd, dilynwch ni ar y cyfryngau cymdeithasol @theriverstrust.
ga: Chun tuilleadh eolais a fháil faoi Iontaobhas na nAbhann, lean muid ar na meáin shóisialta @theriverstrust.

source: Registered charity number: 1107144
cy: Elusen gofrestredig rhif: 1107144
ga: Uimhir charthanachta cláraithe: 1107144

source: This app was hand crafted with love by <2>Flumens.</2> A technical consultancy that excels at building bespoke environmental science and community focussed solutions. For suggestions and feedback please do not hesitate to <6>contact us</6>.
cy: Cafodd yr ap hwn ei greu yn gelfydd gan <2>Flumens</2>. Ymgynghoriaeth dechnegol sy'n rhagori mewn creu datrysiadau gwyddor amgylcheddol pwrpasol sy'n canolbwyntio ar y gymuned. Mae croeso i chi <6>gysylltu â ni</6> os hoffech rannu unrhyw adborth neu awgrymiadau.
ga: Ceapadh an aip seo go grámhar ag<2>Flumens.</2> comhairleoir teicniúil a bhfuil taifead cruthaithe aige i bhforbairt réitigh saincheaptha eolaíochta comhshaoil ​​agus dírithe ar an bpobal. Le haghaidh moltaí agus aiseolais, bíodh leisce ort <6>teagmháil a dhéanamh linn</6>.

source: While you’re out, if you spot a pollution incident, any illegal activity or anything else, please report it immediately to the authorities:
cy: Os ydych chi'n gweld achos o lygredd, unrhyw weithgarwch neu unrhyw beth anghyfreithlon pan fyddwch chi ar grwydr, rhowch wybod i'r awdurdodau yn syth:
ga: Agus tú amuigh, má fheiceann tú eachtra truaillithe, aon ghníomhaíocht mhídhleathach nó aon rud eile, cuir in iúl do na húdaráis láithreach é:

source: These hotlines are open 24 hours a day.<1>England, Scotland and Northern Ireland: <2>0800 80 70 60</2></1><2>Wales: Natural Resources Wales hotline: <2>0300 065 3000</2></2><3>Ireland: EPA Headquarters: <1>053 916 0600</1> / Lo-Call Number: <4>1890 33 55 99</4></3>
cy: Mae'r llinellau ffôn hyn ar agor 24 awr y dydd.<1>Yn Lloegr, yr Alban a Gogledd Iwerddon: <2>0800 80 70 60</2></1><2>Cymru: Llinell ffôn Cyfoeth Naturiol Cymru: <2>0300 065 3000</2></2><3>Iwerddon Pencadlys: <1>053 916 0600</1> / Rhif Lo-call: <4>1890 33 55 99</4></3>
ga: Tá na línte cabhracha seo ar oscailt 24 uair sa lá.<1>Sasana, Albain agus Tuaisceart Éireann: <2>0800 80 70 60</2></1><2>An Bhreatain Bheag: Líne chabhrach Acmhainní Nádúrtha na Breataine Bige: <2>0300 065 3000</2></2><3>Éire: Ceanncheathrú EPA: <1>053 916 0600</1>/ Uimhir Íosghlao:<4>1890 33 55 99</4></3>

source: Discard
cy: Dileu
ga: Scrios

source: Discard survey
cy: Dileu'r arolwg
ga: Scrios an suirbhé

source: Exit
cy: Gadael
ga: Scoir

source: Do you want to close and save the survey for later or discard it?
cy: A ydych chi'n dymuno cau ac arbed yr arolwg am y tro neu ei ddileu?
ga: Ar mhaith leat an suirbhé a dhúnadh agus a shábháil don am atá le teacht nó é a chaitheamh amach?

source: Close
cy: Cau
ga: Dún

source: Continue
cy: Parhau
ga: Lean ar aghaidh

source: Previous survey draft exists, would you like to continue it?
cy: Mae drafftiau blaenorol o'r arolwg ar gael, a hoffech chi barhau gyda'r rheiny?
ga: Tá dréacht suirbhé roimhe seo ann, ar mhaith leat leanúint leis?

source: First name
cy: Enw cyntaf
ga: Céadainm

source: this is a required field
cy: rhaid llenwi'r bwlch hwn
ga: is réimse riachtanach é seo

source: this must be a valid email
cy: rhaid i hwn fod yn gyfeiriad ebost dilys
ga: ní mór gur ríomhphost bailí é seo

source: Last name
cy: Cyfenw
ga: Sloinne

source: Email
cy: Cyfeiriad e-bost
ga: Ríomhphost

source: of
cy: o
ga: de

source: <0>Please tell us more about yourself.</0>
cy: <0>Dywedwch fwy wrthym amdanoch chi'ch hun.</0>
ga: <0>Inis dúinn tuilleadh fút féin, le do thoil.</0>

source: Take your time to observe the river. This survey should take you 15 minutes.
ga: Tóg do chuid ama chun breathnú ar an abhainn. Ba chóir go dtógfadh an suirbhé seo 15 nóiméad ort.

source: Next
cy: Nesaf
ga: Ar Aghaidh

source: User
cy: Defnyddiwr
ga: Úsáideoir

source: this must be a valid postcode
cy: rhaid i hwn fod yn god post dilys
ga: ní mór gur cód poist bailí é seo

source: <0>Are you happy to be contacted by The Rivers Trust to receive the results from this survey and information about future campaigns?</0><1><0>Read our full <2>Privacy Notice</2> to find out how we use your personal data.</0></1>
cy: <0>A ydych chi'n hapus i'r Ymddiriedolaeth Afonydd gysylltu â chi i gael canlyniadau'r arolwg hwn a gwybodaeth am ymgyrchoedd i'r dyfodol?</0><1><0>Darllenwch ein <2>Hysbysiad Preifatrwydd</2> llawn i gael gwybod sut y byddwn yn defnyddio eich data personol.</0></1>
ga: <0>An bhfuil tú sásta go ndéanfadh Iontaobhas na nAibhneacha teagmháil leat chun torthaí an tsuirbhé seo agus faisnéis faoi fheachtais amach anseo a fháil?</0><1><0>Léigh ár <2>Fógra Príobháideachais</2> iomlán chun a fháil amach conas a úsáidimid do shonraí pearsanta.</0></1>

source: I am happy to be contacted by The Rivers Trust
cy: Rwy'n hapus i'r Ymddiriedolaeth Afonydd gysylltu â fi
ga: Tá áthas orm go ndéanfadh Iontaobhas na nAibhneacha teagmháil liom.

source: Are you happy to be contacted by your local Rivers Trust to receive the results from this survey and information about future campaigns, local events and volunteering? To match you to your local Rivers Trust, please share your postcode with us.
cy: A ydych chi'n hapus i'ch Ymddiriedolaeth Afonydd leol gysylltu â chi i rannu canlyniadau'r arolwg hwn a gwybodaeth am ymgyrchoedd yn y dyfodol, digwyddiadau lleol a gwirfoddoli? Rhannwch eich cod post gyda ni i ni eich paru â'ch Ymddiriedolaeth Afonydd leol.
ga: An bhfuil tú sásta go ndéanfadh d’Iontaobhas Abhann áitiúil teagmháil leat chun torthaí an tsuirbhé seo agus faisnéis faoi fheachtais amach anseo, imeachtaí áitiúla agus obair dheonach a fháil? Chun tú a mheaitseáil le d’Iontaobhas Abhann áitiúil, roinn do chód poist linn le do thoil.

source: I am happy to be contacted by my local Rivers Trust
cy: Rwy'n hapus i fy Ymddiriedolaeth Afonydd leol gysylltu â mi
ga: Tá áthas orm go ndéanfaidh Iontaobhas na nAibhneacha áitiúil teagmháil liom.

source: Postcode
cy: Cod post
ga: Cód Poist

source: Contact
cy: Cyswllt
ga: Teagmháil

source: Have you ever taken part in a citizen science activity before?
cy: A ydych chi erioed wedi cymryd rhan mewn gweithgaredd gwyddoniaeth dinasyddion o'r blaen?
ga: An raibh tú riamh páirteach i ngníomhaíocht eolaíochta saoránach roimhe seo?

source: Yes
cy: Ydw
ga: Tá

source: No
cy: Nac ydw
ga: Níl

source: Unsure
cy: Dwi ddim yn siŵr
ga: Níl mé cinnte

source: Experience
cy: Profiad
ga: Taithí

source: How many of you have taken part in this survey today?
cy: Faint ohonoch sydd wedi cymryd rhan yn yr arolwg hwn heddiw?
ga: Cé mhéad agaibh a ghlac páirt sa suirbhé seo inniu?

source: Surveyors
cy: Arolygwyr
ga: Suirbhéirí

source: Enable your GPS to set your location, or use the map to zoom in and tap on your location.
cy: Defnyddiwch eich GPS i osod eich lleoliad, neu defnyddiwch y map i chwyddo mewn a thapio ar eich lleoliad.
ga: Cumasaigh do GPS chun do shuíomh a shocrú, nó bain úsáid as an léarscáil chun zúmáil isteach agus tapáil ar do shuíomh.

source: READ MORE
cy: DARLLEN MWY
ga: LÉIGH TUILLEADH

source: Got it
cy: Iawn
ga: Tuigim é.

source: Please zoom in to find the spot that best matches your location.
cy: Chwyddwch mewn i ddod o hyd i'r man sy'n cyd-fynd orau â'ch lleoliad.
ga: Zúmáil isteach le do thoil chun an láthair is fearr a oireann do do shuíomh a aimsiú.

source: Make sure you have the GPS turned on and permissions granted. If you are conducting the survey offline or without a network connection, the app will not find your location on the map, but your GPS should record this for uploading later.
cy: Gwnewch yn siŵr bod y GPS wedi'i droi ymlaen a'r caniatâd wedi'i roi. Os ydych chi'n cynnal yr arolwg all-lein neu heb gysylltiad rhwydwaith, ni fydd yr ap yn dod o hyd i'ch lleoliad ar y map, ond dylai eich GPS gofnodi hyn i'w uwchlwytho yn nes ymlaen.
ga: Cinntigh go bhfuil an GPS casta air agus ceadanna deonaithe agat. Mura bhfuil tú ag déanamh an tsuirbhé as líne nó gan nasc líonra, ní bhfaighidh an aip do shuíomh ar an léarscáil, ach ba chóir go dtaifeadfadh do GPS é seo le huaslódáil níos déanaí.

source: Looks like you're offline. The map view is only available with an internet connection. You can still use the GPS to set your current survey location.
ga: Is cosúil go bhfuil tú as líne. Níl an radharc léarscáile ar fáil ach amháin le nasc idirlín. Is féidir leat an GPS a úsáid fós chun do shuíomh suirbhé reatha a shocrú.

source: Current survey location
ga: Suíomh reatha an tsuirbhé

source: Coordinates
ga: Comhordanáidí

source: OS Grid
ga: Eangach OS

source: Accuracy
ga: Cruinneas

source: Refresh
ga: Athnuachan

source: Location
cy: Lleoliad
ga: Suíomh

source: <0>Upload a photo of the river.</0>
cy: <0>Uwchlwythwch lun o'r afon.</0>
ga: <0>Íoslódáil grianghraf den abhainn.</0>

source: <0>We’ll share selected images to celebrate our rivers and also to shine a light on the problems they face. While we won’t make every image available, we’ll endeavour to use them all in our research behind the scenes.</0>
ga: <0>Roinnfimid íomhánna roghnaithe chun ceiliúradh a dhéanamh ar ár n-aibhneacha agus chun aird a tharraingt ar na fadhbanna atá rompu. Cé nach gcuirfimid gach íomhá ar fáil, déanfaimid ár ndícheall iad uile a úsáid inár dtaighde taobh thiar de na radhairc.</0>

source: No photo has been added.<br/>Press <4><0></0></4> to add.
cy: Nid oes llun wedi'i ychwanegu.<br/>Pwyswch <4><0></0></4> i ychwanegu llun.
ga: Níl aon ghrianghraf curtha leis.<br/>Brúigh<4><0></0></4> le cur leis.

source: Gallery
cy: Oriel
ga: Gailearaí

source: Camera
ga: Ceamara

source: Cancel
cy: Canslo
ga: Cealaigh

source: Choose a method to upload a photo
cy: Dewiswch ddull i uwchlwytho llun
ga: Roghnaigh modh chun grianghraf a uaslódáil

source: Delete
cy: Dileu
ga: Scrios

source: Are you sure you want to remove this photo?
cy: Ydych chi'n siŵr eich bod am ddileu'r llun hwn?
ga: An bhfuil tú cinnte gur mian leat an grianghraf seo a bhaint?

source: Note: it will remain in the gallery.
cy: Sylwer: bydd y llun yn parhau yn yr oriel.
ga: Tabhair faoi deara: fanfaidh sé sa ghailearaí.

source: Photo
cy: Llun
ga: Grianghraf

source: Has it rained in the last 24 hours?
cy: Ydy hi wedi bwrw glaw yn ystod y 24 awr ddiwethaf?
ga: An bhfuil sé tar éis cur báistí le 24 uair an chloig anuas?

source: Don't know
cy: Dydw i ddim yn gwybod
ga: Níl a fhios agam

source: Currently raining
cy: Mae hi'n bwrw glaw ar hyn o bryd.
ga: Ag cur báistí faoi láthair

source: Rain
cy: Glaw
ga: Báisteach

source: How fast is the river flowing?
cy: Pa mor gyflym mae'r afon yn llifo?
ga: Cé chomh tapa agus atá an abhainn ag sileadh?

source: Still
cy: Mae'r afon yn llonydd
ga: Fós

source: Slow – Slower than walking pace
cy: Araf - arafach na chyflymder cerdded
ga: Mall – Níos moille ná luas siúil

source: Steady – About walking pace
cy: Cyflymdra cyson - tua'r un cyflymder â cherdded
ga: Seasmhach – Thart ar luas siúil

source: Surging – Faster than walking pace
cy: Ymchwyddol - cyflymach na chyflymder cerdded
ga: Ag borradh – Níos tapúla ná luas siúil

source: River Speed
cy: Cyflymder yr afon
ga: Luas na hAbhann

source: How often do you usually visit this river/place?
cy: Pa mor aml ydych chi'n ymweld â'r afon hon/y man hwn?
ga: Cé chomh minic a thugann tú cuairt ar an abhainn/áit seo de ghnáth?

source: Daily
cy: Yn ddyddiol
ga: Laethúil

source: Weekly
cy: Yn wythnosol
ga: Seachtainiúil

source: Monthly
cy: Yn fisol
ga: Míosúil

source: Less than monthly
cy: Llai nag unwaith y mis
ga: Níos lú ná míosúil

source: This is my first time
cy: Dyma'r tro cyntaf
ga: Seo mo chéad uair

source: Visits
cy: Ymweliadau
ga: Cuairteanna

source: Based on what you can see, what is your first impression of this river?
cy: Yn seiliedig ar yr hyn y gallwch ei weld, beth yw eich argraff gyntaf o'r afon hon?
ga: Bunaithe ar a bhfuil le feiceáil agat, cad é do chéad tuiscint ar an abhainn seo?

source: Healthy
cy: Iach
ga: Sláintiúil

source: Unhealthy
cy: Ddim yn iach
ga: Míshláintiúil

source: Other
cy: Arall
ga: Eile

source: Health
cy: Iechyd
ga: Sláinte

source: What one word would you use to describe how you feel when you are by this river?
cy: Pa air fyddech chi'n ei ddewis i ddisgrifio sut rydych chi'n teimlo pan fyddwch wrth ymyl yr afon hon?
ga: Cén focal amháin a d'úsáidfeá chun cur síos a dhéanamh ar an gcaoi a mothaíonn tú nuair a bhíonn tú cois abhann seo?

source: Remember to describe how you feel, not what you can see.
cy: Cofiwch ddisgrifio sut rydych chi'n teimlo, nid yr hyn y gallwch ei weld.
ga: Cuimhnigh cur síos a dhéanamh ar an gcaoi a mothaíonn tú, ní ar a bhfuil le feiceáil agat.

source: Feeling
cy: Teimlo
ga: Mothú

source: From where you are standing, do you think this river is natural?
cy: O'r fan rydych chi'n sefyll, a ydych chi'n meddwl bod yr afon hon yn naturiol?
ga: Ón áit ina bhfuil tú i do sheasamh, an gceapann tú gur abhainn nádúrtha í seo?

source: A natural river is a flowing body of water that has not been significantly altered or impacted by human activities.
cy: Mae afon naturiol yn gorff o ddŵr sy'n llifo nad yw wedi'i newid na'i effeithio'n sylweddol gan weithgareddau dynol.
ga: Is corp uisce atá ag sileadh é abhainn nádúrtha nach bhfuil athraithe ná tionchar suntasach ag gníomhaíochtaí an duine air.

source: Natural
cy: Naturiol
ga: Nádúrtha

source: Mixed
cy: Cymysg
ga: Measctha

source: Unnatural
cy: Annaturiol
ga: Mínádúrtha

source: Naturalness
cy: Naturioldeb
ga: Nádúrthacht

source: Can you see any barriers in this river?
cy: A allwch chi weld unrhyw rwystrau yn yr afon hon?
ga: An bhfeiceann tú aon bhacainní san abhainn seo?

source: A barrier is a physical structure, either natural or artificial, located within a river channel. They can have both positive and negative impacts on ecosystem health. Select all that apply.
cy: Mae rhwystr yn strwythur ffisegol, naill ai naturiol neu artiffisial, wedi'i leoli o fewn sianel afon. Gallant gael effeithiau cadarnhaol a negyddol ar iechyd ecosystemau. Dewiswch bob un sy'n berthnasol.
ga: Is struchtúr fisiceach é bacainn, bíodh sé nádúrtha nó saorga, atá suite laistigh de chainéal abhann. Is féidir leo tionchair dhearfacha agus dhiúltacha araon a bheith acu ar shláinte an éiceachórais. Roghnaigh na cinn uile is infheidhme.

source: <0>Natural</0> – e.g. waterfalls, fallen trees stretching across the river
cy: <0>Naturiol</0> - e.e. rhaeadrau, coed wedi cwympo'n ymestyn ar draws yr afon
ga: <0>Nádúrtha</0> – e.g. easanna, crainn tite ag síneadh trasna na habhann

source: <0>Artificial</0> – e.g. dams, weirs, locks, culverts, fords, sluices
cy: <0>Artiffisial</0> - e.e. argaeau, coredau, lociau, ceuffosydd, rhydau, llifddorau
ga: <0>Saorga</0> – e.g. dambaí, coraí, glais, cultair, áthanna, sluicíní

source: None
cy: Dim
ga: Dada

source: Barriers
cy: Rhwystrau
ga: Bacainní

source: Are the river banks mostly natural or artificial?
cy: A yw'r cefnau yn naturiol neu'n artiffisial yn bennaf?
ga: An bhfuil bruacha na habhann nádúrtha nó saorga den chuid is mó?

source: <0>Mostly natural</0> – made up of soil, rocks and vegetation that have been shaped by the movement of the river
cy: <0>Naturiol yn bennaf</0> - wedi'u creu o bridd, creigiau a llystyfiant sydd wedi'u siapio gan symudiad yr afon
ga: <0>Nádúrtha den chuid is mó</0> – déanta suas d’ithir, carraigeacha agus fásra atá múnlaithe ag gluaiseacht na habhann

source: <0>Mixed</0> – both natural features, as well as sections of straightening or human built structures
cy: <0>Cymysg</0> - gyda nodweddion naturiol, yn ogystal â rhannu sydd wedi'u sythu neu'n cynnwys strwythurau wedi'u hadeiladu gan ddyn
ga: <0>Measctha</0> – an dá cheann natural nádúrtha, chomh maith le rannóga de ag díriú nó daonna tógtha struchtúir

source: <0>Mostly artificial</0> – typically made of metal, concrete, wood or stone and characterised by a range of features such as straight sides, and concrete riverbeds
cy: <0>Artiffisial yn bennaf</0> - wedi'u gwneud fel arfer o fetel, concrit, pren neu garreg ac wedi'u nodweddu gan amrywiaeth o nodweddion fel ochrau syth, a gwelyau afon concrit
ga: <0>Saorga den chuid is mó</0> – déanta as miotal, coincréit, adhmad nó cloch de ghnáth agus tréithrithe ag réimse gnéithe amhail taobhanna díreacha, agus leaba abhann coincréite

source: Banks
cy: Cefnau
ga: Bainc

source: What wildlife have you seen during your survey?
cy: Pa fywyd gwyllt ydych chi wedi'i weld yn ystod eich arolwg?
ga: Cén fhiadhúlra a chonaic tú le linn do shuirbhé?

source: Seeing a variety of species, including those listed below, can provide a good indication of the overall health of a river.
cy: Gall gweld amrywiaeth o rywogaethau, gan gynnwys y rhai a restrir isod, roi syniad da o iechyd cyffredinol afon.
ga: Is féidir le feiceáil réimse speiceas, lena n-áirítear iad siúd atá liostaithe thíos, léargas maith a thabhairt ar shláinte fhoriomlán abhann.

source: Duck
cy: Hwyaid
ga: Lacha

source: Mayflies or stoneflies
cy: Cylion Mai neu bryfed y cerrig
ga: Cuileoga Bealtaine nó cuileoga cloiche

source: None – I didn't see any wildlife
cy: Dim - ni welais unrhyw fywyd gwyllt
ga: Dada – ní fhaca mé aon fhiadhúlra

source: What plants can you see in and around the river today?
cy: Pa blanhigion allwch chi eu gweld yn ac o gwmpas yr afon heddiw?
ga: Cad iad na plandaí is féidir leat a fheiceáil san abhainn agus timpeall uirthi inniu?

source: Plants may suggest a healthy river but that can be misleading, sometimes they can be non-native. Select all that apply.
cy: Gall planhigion awgrymu afon iach ond gall hynny fod yn gamarweiniol, weithiau gallant fod yn anfrodorol. Dewiswch bob un sy'n berthnasol.
ga: D’fhéadfadh plandaí abhainn shláintiúil a thabhairt le fios ach is féidir leis sin a bheith míthreorach, uaireanta is féidir leo a bheith neamhdhúchasach. Roghnaigh na cinn uile is infheidhme.

source: Plants growing completely under the water
cy: Planhigion yn tyfu yn gyfan gwbl o dan y dŵr
ga: Plandaí ag fás go hiomlán faoin uisce

source: Plants emerging out of the water
cy: Planhigion yn ymddangos allan o'r dŵr
ga: Plandaí ag teacht amach as an uisce

source: Plants floating on the surface
cy: Planhigion yn arnofio ar y wyneb
ga: Plandaí ag snámh ar an dromchla

source: Plants growing on the bank, completely out of the water (including trees)
cy: Planhigion yn tyfu ar y gefnen, yn gyfan gwbl allan o'r dŵr (yn cynnwys coed)
ga: Plandaí ag fás ar an mbruach, go hiomlán lasmuigh den uisce (lena n-áirítear crainn)

source: Algae – green, hair-like, can form clumps on the surface of the water
cy: Algâu - gall algâu gwyrdd tebyg i wallt ffurfio clympiau ar wyneb y dŵr
ga: Algaí – glasa, cosúil le gruaig, is féidir leo cnapáin a fhoirmiú ar dhromchla an uisce

source: None – I can't see any plants in or out of the water
cy: Dim - ni welais unrhyw blanhigion yn y dŵr na thu allan i'r dŵr
ga: Dada – ní fheicim aon phlandaí istigh ná lasmuigh den uisce

source: Plants
cy: Planhigion
ga: Plandaí

source: How clear or cloudy is the water?
cy: Pa mor glir neu gymylog yw'r dŵr?
ga: Cé chomh soiléir nó scamallach is atá an t-uisce?

source: Please don't climb down the river bank and only look if it is safe to do so. If you can't see because it is too far away or the water is too murky, then select 'Don't know'.
cy: Peidiwch â dringo i lawr glan yr afon. Edrychwch dim ond os yw'n ddiogel i chi wneud hynny. Os na allwch weld oherwydd ei fod yn rhy bell i ffwrdd neu fod y dŵr yn rhy dywyll, dewiswch 'Ddim yn gwybod'.
ga: Ná dreap síos bruach na habhann agus ná féach ach amháin má tá sé sábháilte é sin a dhéanamh. Mura féidir leat a fheiceáil mar gheall ar a bheith rófhada uainn nó an t-uisce ró-dhorcha, roghnaigh 'Níl a fhios agam'.

source: Very clear, I can see right through the water
cy: Clir iawn, gallaf weld trwy'r dŵr
ga: An-soiléir, is féidir liom a fheiceáil díreach tríd an uisce

source: There’s a bit of sediment
cy: Mae ychydig o waddod
ga: Tá beagán dríodair ann

source: It’s quite murky
cy: Mae'r dŵr yn eithaf tywyll
ga: Tá sé sách doiléir

source: There’s lots of sediment, I can’t see through the water at all
cy: Mae llawer o waddod. Ni allaf weld trwy'r dŵr o gwbl.
ga: Tá neart dríodair ann, ní féidir liom a fheiceáil tríd an uisce ar chor ar bith

source: <0>Very clear</0> – It is easy to see through the water and objects at the bottom or far beneath the surface are clearly visible.
cy: <0>Clir iawn</0>– Mae'n rhwydd gweld trwy'r dŵr ac mae gwrthrychau yn y gwaelod neu ymhellach y tu hwnt i'r arwyneb yn gwbl weladwy.
ga: <0>An-soiléir</0> – Is furasta a fheiceáil tríd an uisce agus tá rudaí ag an mbun nó i bhfad faoin dromchla le feiceáil go soiléir.
